# Pandas

In [83]:
import pandas as pd
import numpy as np

Pandas is a Python library for data analysis and manipulation.

Built on top of NumPy â†’ faster and optimized for handling tabular data.

Name comes from "Panel Data

### Series in pandas

a series is a one dimensional labeled array or sequence in pandas

In [84]:
lis = [1,2,3,4]
series_by_list = pd.Series(lis)

dict = {'a':1, 'b':2, 'c':3}
series_by_dict = pd.Series(dict)

arr = np.arange(4)
series_by_array = pd.Series(arr)

index = ["first", "second", "third"]
list2 = [1,2,3]

series_with_index = pd.Series(list2, index=index)

series_with_index

first     1
second    2
third     3
dtype: int64

### DataFrame in Pandas

dataframes is a datatype in pandas it can be seen as a collection of various series in a form of table
there are various ways of creating a dataframes in pandas

In [85]:
by_dictionary = {"name":["mohit", "rohit"], 
                 "income": [1000, 2000],
                 "city":["meerut", "mumbai"]}

df_by_dict = pd.DataFrame(by_dictionary)

by_list = [["mohit",1000, "meerut"],["rohit", 2000, "mumbai"]]
columns = ["name", "income", "city"]
df_by_list = pd.DataFrame(by_list, columns=columns)

by_list_of_dictionary = [{"name":"mohit", "income": 1000,"city": "meerut"}, 
                         {"name":"rohit", "income": 2000,"city": "delhi"}]

df_by_list_of_dictionary = pd.DataFrame(by_list_of_dictionary)

df_by_dict
# print(df_by_list)
# print(df_by_list_of_dictionary)

    name  income    city
0  mohit    1000  meerut
1  rohit    2000  mumbai

## Accessing columns and rows in a dataframe

In [86]:
by_dictionary = {"name":["mohit", "rohit"], 
                 "income": [1000, 2000],
                 "city":["meerut", "mumbai"]}

df = pd.DataFrame(by_dictionary)

# accessing First column -> name 
# print(df['name'])
# df.name

# accessing names and income
df[["name", "income"]]

    name  income
0  mohit    1000
1  rohit    2000

In [87]:

# accessing a 1st row
print(df.iloc[0])

# accessing multiple rows
df.iloc[[0, 1]]

name       mohit
income      1000
city      meerut
Name: 0, dtype: object

    name  income    city
0  mohit    1000  meerut
1  rohit    2000  mumbai

## filtering or conditional accessing

In [88]:
by_dictionary = {"name":["mohit", "rohit"], 
                 "income": [1000, 2000],
                 "city":["meerut", "mumbai"]}

df = pd.DataFrame(by_dictionary)

# accessing names having income above 1000
print(df[df.income > 1000])

# accessing names having income above 1000 and city mumbai
df[(df.income > 1000 ) & (df.city == "mumbai")]

    name  income    city
1  rohit    2000  mumbai

    name  income    city
1  rohit    2000  mumbai

## Adding a column and row in the dataframe

In [89]:
# adding a columns in dataframe
df['new_column'] = [1, 2]
df

# adding multiple columns in dataframe
df[['new_column2', 'new_column3']] = [['a', '@'], ['b', '#']]
print(df)

# adding a row in dataframe
df.loc[2] = ["rohit", 2000, "mumbai", 3, 'c', '*']
df

    name  income    city  new_column new_column2 new_column3
0  mohit    1000  meerut           1           a           @
1  rohit    2000  mumbai           2           b           #

    name  income    city  new_column new_column2 new_column3
0  mohit    1000  meerut           1           a           @
1  rohit    2000  mumbai           2           b           #
2  rohit    2000  mumbai           3           c           *

## Deleting row and columns in dataframes

In [90]:
# deleting columns in a dataframe
df.drop(['new_column2', 'new_column3'], axis=1, inplace=True)
df

# deleting rows from a dataframe
df.drop([2], axis=0, inplace=True)
df

    name  income    city  new_column
0  mohit    1000  meerut           1
1  rohit    2000  mumbai           2